cfd/openfoam/compressible/sonicFoam/01_Laminar/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// ************************************************************************** //

application       sonicFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           1.0e-2;

deltaT            1e-7;

writeControl      runTime;

writeInterval     1.0e-4;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

// ************************************************************************** //

functions
{
    libs            (fieldFunctionObjects);

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}

// ************************************************************************** //

