cfd/openfoam/compressible/sonicFoam/01_Laminar/0.orig/include/boundaryConditions
// ************************************************************************** //
// Boundary conditions
// ************************************************************************** //

flowVelocity    650.0;      // [m/s] flow velocity
pressure        1.0e5;      // [Pa] pressure 
temperature     300.0;      // [K] temperature

// ************************************************************************** //
