cfd/openfoam/compressible/sonicFoam/01_Laminar/system/include/boundaryLayer
// ************************************************************************** //
// Boundary layer mesh parameters
// ************************************************************************** //

boundaryLayerMesh_numberOflayers      10;
boundaryLayerMesh_expansionRatio      1.25;
boundaryLayerMesh_finalLayerThickness 0.4;
boundaryLayerMesh_minThickness        0.1;

// ************************************************************************** //
