cfd/openfoam/compressible/sonicFoam/01_Laminar/system/include/controlVolume
// ************************************************************************** //
// Control volume dimensions
// ************************************************************************** //

controlVolOriginX  -30.0;
controlVolLength   120.0;
controlVolWidth     40.0;
controlVolHeight    40.0;

// ************************************************************************** //
// Main section dimensions
// ************************************************************************** //

mainSectionOriginX -10.0;
mainSectionLength   30.0;

// ************************************************************************** //
// Cell size
// ************************************************************************** //

mainSectionCellSize 1.0;

// ************************************************************************** //
